#include "HTML.hpp"

void test1() {
    HTML html("Специальные курсы по математике");

    HTML_Table table(7);

    HTML_Div Div("1");

    table.setTableName("Спецкурсы ВМК МГУ 2023 весна");
    table.setCol_names("Каф.", "Название спецкурса", "Дата первой лекции", "Преподаватель", "День недели", "Время", "Аудитория");
    table.addRow("MF", "Некорректные задачи линейной алгебры и анализа", "", "Разборов А.Г.", "вт.", "16:20", "");
    table.addRow("", "Практическое введение в машинное обучение", "19.02.2024", "Березин С.Б.", "пн.", "18:00", "704");
    table.addRow("", "Вариационные методы в обработке изображений", "22.02.2024", "Крылов А.С., Сорокин Д.В.", "чт.", "10:30", "524");
    table.addRow("", "Нейросетевые методы численного решения дифференциальных уравнений", "20.02.2024", "Крылов А.С.", "вт.", "16:20", "607");
    table.addRow("", "Нелинейные модели оптической синергетики", "", "Разгулин А.В.", "", "", "");
    table.addRow("", "Вычислительные методы обработки изображений", "22.02.2024", "Крылов А.С., Сорокин Д.В.", "чт.", "10:30", "524");
    table.addRow("", "Использование математических моделей в глубоком обучении", "", "Крылов А.С.", "", "", "");
    table.addRow("ВТМ", "Элементы алгебраической топологии (новый)", "19.02.2024", "Богатырев А.Б., Смирнов М.С.", "пн.", "14:35", "589");
    table.addRow("", "Математические технологии исследования сложных систем", "16.02.2024", "Тыртышников Е.Е., Матвеев С.А.", "пт.", "16:20", "506");
    table.addRow("", "Введение в комплексный анализ и его приложения", "15.02.2024", "Богатырев А.Б., Смирнов М.С.", "чт.", "16:20", "589");
    table.addRow("", "Теория гомологий", "16.02.2024", "Богатырев А.Б., Смирнов М.С.", "пт.", "12:15", "582");
    table.addRow("Э", "Алгебра и геометрия тензоров", "20.02.2024", "Тыртышников Е.Е.", "вт.", "8:45", "П-12");
    table.addRow("", "Метод граничных интегральных уравнений", "15.02.2024", "Сетуха А.В.", "чт.", "16:20", "508");
    table.addRow("", "Методы численного анализа для исследования в прикладных задачах", "16.02.2024", "Замарашкин Н.Л., Матвеев С.А.", "пт.", "18:00", "506");
    table.addRow("", "Математическое моделирование геофизической турбулентности", "", "Степаненко В.М., Мортиков Е.В.", "", "", "НИВЦ");
    table.addRow("", "Математические модели в демографии и эпидемиологии", "20.02.2024", "Романюха А.А., Санникова Т.Е.", "вт.", "16:20", "658");
    table.addRow("", "Численный метод интегральных уравнений в краевых задачах", "15.02.2024", "Сетуха А.В.", "чт.", "16:20", "508");
    table.addRow("", "Алгебраические многообразия и тензоры", "13.02.2024", "Тыртышников Е.Е.", "вт.", "8:45", "510");
    table.addRow("ВМ", "Методы частиц как альтернатива разностным и конечно-элементным", "13.02.2024", "Богомолов С.В.", "вт.", "12:30", "621");
    table.addRow("", "Математические модели EDA", "27.02.2024", "Хапаев М.М.", "вт.", "14:35", "621");
    table.addRow("", "Введение в индустриальную математику", "21.02.2024", "Головизнин В.М.", "ср.", "14:35", "570");
    table.addRow("", "Численные методы в математическом моделировании", "29.02.2024", "Савенкова Н.П., Мокин А.Ю.", "чт.", "16:20", "606");
    table.addRow("", "Вычислительные методы молекулярной динамики", "14.02.2024", "Еленин Г.Г.", "ср.", "08:45", "621");
    table.addRow("", "Математические модели в гуманитарных науках", "01.03.2024", "Шведовский В.А.", "пт.", "13:30", "658");
    table.addRow("", "Введение в механику сплошных сред и вычислительную газовую динамику", "", "Козубская Т.К., г.н.с. ИПМ им.Келдыша РАН", "", "", "Б");
    table.addRow("", "Несамосопряженные разностные схемы для уравнения теплопроводности и их устойчивость", "16.02.2024", "Ионкин Н.И., Морозова В.А.", "пт.", "16:20", "690");
    table.addRow("", "Стохастическое моделирование", "13.02.2024", "Богомолов С.В.", "вт.", "18:00", "621");
    table.addRow("", "Дополнительные главы микромоделирования", "13.02.2024", "Богомолов С.В.", "вт.", "16:20", "621");
    table.addRow("ФА", "Актуальные задачи современного функционального анализа и математической физики", "27.02.2024", "Капустин Н.Ю.", "вт.", "16:20", "П-8а");
    table.addRow("АНИ", "Архитектура и программирование массивно-параллельных вычислительных систем", "19.02.2024", "Боресков А.В.", "пн.", "19:30", "", "Б");
    table.addRow("Э", "Обратные задачи динамики", "09.02.2024", "Ильин А.В.", "пт.", "14:35", "729", "М 1 к.");
    table.addRow("", "Обобщенное оптимальное управление возмущаемыми динамическими системами", "22.02.2024", "Смольяков Э.Р.", "чт.", "12:50", "", "М 2 к.");
    table.addRow("", "Геометрическая теория нелинейных управляемых систем", "22.02.2024", "Елкин В.И.", "чт.", "12:15", "", "М 2 к.");
    table.addRow("", "Вариационные методы исследования нелинейных управляемых динамических систем", "15.02.2024", "Афанасьев А.П.", "чт.", "14:30", "658", "М");
    table.addRow("", "Неклассические методы теории стабилизации", "", "Фурсов А.С.", "", "", "Асп.");
    table.addRow("", "Обратные задачи теории управления", "", "Ильин А.В.", "", "", "Асп.");
    table.addRow("СА", "Моделирование и управление манипуляционными роботами", "12.02.2024", "Усова А.А.", "пн.", "9:00", "", "М");
    table.addRow("", "Экономические модели на сетях", "14.02.2024", "Обросова Н.К.", "ср.", "10:30", "582", "М");
    table.addRow("МС", "Машинное обучение и аналитика прогнозирования (на англ.яз.)", "23.02.2024", "Назаров Л.В.", "пт.", "19:00", "дист.", "Б");
    table.addRow("", "Аналитические методы в теории массового обслуживания (новый)", "13.02.2024", "Ушаков В.Г.", "вт.", "14:35", "516", "Б");
    table.addRow("", "Машинное обучение с применением R и Python (на англ.яз.)", "24.02.2024", "Назаров Л.В.", "сб.", "19:00", "дист.", "М");
    table.addRow("", "Современный NLP. Большие языковые модели (новый)", "13.02.2024", "Макаренко В.А.", "вт.", "18:00", "П-5", "М");
    table.addRow("", "Классические модели финансовой математики (в непрерывном времени) (на англ.яз.) (новый)", "19.02.2024", "Колокольцов В.Н.", "пн.", "14:35", "505", "М");
    table.addRow("ММП", "Логический анализ данных в распознавании", "21.02.2024", "Дюкова Е.В., Прокофьев П.А.", "ср.", "16:20", "дист.", "Б");
    table.addRow("", "Логика высказываний", "20.02.2024", "Гуров С.И.", "вт.", "10:40", "дист.", "Б");
    table.addRow("", "Задачи и алгоритмы вычислительной геометрии", "21.02.2024", "Местецкий Л.М.", "ср.", "16:20", "609", "Б");
    table.addRow("", "Методы машинного обучения и поиск закономерностей в данных", "15.02.2024", "Сенько О.В.", "чт.", "18:00", "506", "Б");
    table.addRow("", "Нейросетевые методы обработки изображений", "20.02.2024", "Китов В.В.", "вт.", "16:20", "609", "Б");
    table.addRow("", "Основы математических методов прогнозирования (новый)", "22.03.2024", "Воронцов К.В., Кравцова О.А., Сердюк Ю.А.", "пт.", "16:20", "582", "Б");
    table.addRow("", "Вероятностное тематическое моделирование", "22.02.2024", "Воронцов К.В.", "чт.", "18:00", "658", "");
    table.addRow("МК", "Программируемые логические интегральные схемы", "", "Шуплецов М.С.", "ср.", "14:35", "642", "Б");
    table.addRow("", "Вложения графов и клеточные схемы: теория и приложения", "", "Ложкин С.А., Зизов В.С.", "", "", "Б");
    table.addRow("", "Python для аналитиков данных (на англ.яз.)", "08.02.24", "Шуплецов М.С.", "чт.", "12:15", "579", "М");
    table.addRow("", "Математические модели и методы физического синтеза сверхбольших интегральных схем", "14.02.24", "Шуплецов М.С.", "ср.", "10:30", "510", "М");
    table.addRow("", "Практикум по дискретным структурам", "07.02.24", "Бухман А.В.", "ср.", "8:45", "504", "М");
    table.addRow("", "Математические модели и методы проектирования архитектуры сверхбольших интегральных схем", "09.02.24", "Подымов В.В.", "пт.", "14:35", "508", "М");
    table.addRow("", "Элементы теории синтеза, надежности и контроля дискретных управляющих систем", "08.02.24", "Ложкин С.А., Романов Д.С.", "чт.", "12:50", "527", "М");
    table.addRow("", "Математическая биология", "08.02.24", "Козлов В.Н.", "чт.", "14:35", "582-а", "М");
    table.addRow("ИБ", "Теоретико-числовые алгоритмы в криптографии", "21.02.2024", "Черепнев М.А.", "ср.", "17:00", "607", "Б");
    table.addRow("", "Управление проектами и информационными рисками", "21.02.2024", "Зива С.В.", "ср.", "16:20", "660", "Б");
    table.addRow("", "Введение в теоретико-кодовые криптосистемы", "19.02.2024", "Чижов И.В.", "пн.", "18:00", "", "Б");
    table.addRow("", "Технологические угрозы и системы кибербезопасности (новый)", "14.02.2024", "Ильюшин Е.А.", "ср.", "17:00", "П-6", "М");
    table.addRow("", "Теория кодирования в криптографии", "19.02.2024", "Чижов И.В.", "пн.", "18:00", "551", "М");
    table.addRow("АСВК", "Введение в сети передачи и обработки данных", "13.02.2024", "Смелянский Р.Л., Балашов В.В.", "вт.", "18:00", "П-8а", "Б 1-2 к.");
    table.addRow("", "Практические аспекты сетевых протоколов в Linux", "13.02.2024", "Курячий Г.В.", "пн.", "14:35", "П-14", "Б");
    table.addRow("", "Введение в облачные вычислительные среды", "19.02.2024", "Писковский В.О.", "пн.", "18:00", "247а", "Б");
    table.addRow("", "Совместная разработка приложений на Python3", "13.02.2024", "Курячий Г.В.", "вт.", "14:35", "П-5", "Б");
    table.addRow("", "Введение в архитектуру и язык ассемблера RISC-V", "13.02.2024", "Курячий Г.В.", "вт.", "18:00", "П-5", "Б");
    table.addRow("", "Методы совместной разработки на базе ЯП Python3", "13.02.2024", "Курячий Г.В.", "вт.", "14:35", "П-5", "М");
    table.addRow("", "Программно-конфигурируемые сети", "14.02.2024", "Пашков В.Н.", "ср.", "08:45", "582", "М");
    table.addRow("", "Управление сетевыми ресурсами и качеством сервиса", "07.02.2024", "Степанов Е.П.", "ср.", "10:30", "579", "М");
    table.addRow("", "Сетевые протоколы в Linux", "12.02.2024", "Курячий Г.В.", "пн.", "14:35", "П-14", "М");
    table.addRow("", "Облачные вычисления и виртуализация информационных ресурсов", "07.02.2024", "Антоненко В.А.", "ср.", "08:45", "579", "М");
    table.addRow("", "Облачные вычислительные среды", "19.02.2024", "Писковский В.О.", "пн.", "18:00", "247а", "М");
    table.addRow("", "Методы теории телетрафика (новый)", "16.02.2024", "Батенков К.А.", "пт.", "08:45", "607", "М");
    table.addRow("", "Архитектура и язык ассемблера RISC-V", "13.02.2024", "Курячий Г.В.", "вт.", "18:00", "П-5", "М");
    table.addRow("ИИТ", "Трехмерное компьютерное зрение", "16.02.2024", "Конушин А.С.", "пт.", "16:20", "702", "Б");
    table.addRow("", "Интеллектуальные методы обработки видео", "14.02.2024", "Ватолин Д.С.", "ср.", "14:35", "609", "Б");
    table.addRow("", "Основы программирования графических процессоров (новый)", "19.02.2024", "Фролов В.А.", "пн.", "8:45", "702", "Б");
    table.addRow("", "Язык программирования Rust (новый)", "15.02.2024", "Чернов А.В.", "чт.", "16:20", "507", "Б");
    table.addRow("", "Введение в Vulkan (новый)", "19.02.2024", "Санжаров В.В., Щербаков А.С.", "пн.", "10:30", "702", "М");
    table.addRow("", "Дополнительные главы компьютерного зрения", "16.02.2024", "Конушин А.С.", "пт.", "18:00", "702", "М");
    table.addRow("", "Системы оценки и мониторинга процессов в интеллектуальных социотехнических системах", "15.02.2024", "Рыжов А.П.", "чт.", "16:20", "607", "М");
    table.addRow("СКИ", "Введение в квантовую механику", "21.02.2024", "Ожигов Ю.И.", "ср.", "18:00", "576", "Б");
    table.addRow("", "Особенности практического использования нейронных сетей", "20.02.2024", "Буряк Д.Ю.", "вт.", "18:00", "607", "Б");
    table.addRow("", "Практическое применение нейронных сетей", "20.02.2024", "Буряк Д.Ю.", "вт.", "18:00", "607", "М");
    table.addRow("", "Квантовые коммуникации", "14.01.2024", "Молотков С.Н.", "ср.", "18:00", "575", "М");
    table.addRow("АЯ", "Рекурсивные алгоритмы (новый)", "15.02.2024", "Баева Н.В.", "чт.", "18:00", "524", "Б");
    table.addRow("", "Автоматическое извлечение знаний из текстов", "16.02.2024", "Лукашевич Н.В.", "пт.", "18:00", "613", "Б");
    table.addRow("", "Автоматическое порождение графов знаний", "16.02.2024", "Лукашевич Н.В.", "пт.", "18:00", "613", "М");
    table.addRow("", "Большие языковые модели в вопросно-ответных системах: от трансформера до собственного чат бота (новый)", "15.02.2024", "Тихомиров М.М.", "чт.", "18:00", "607", "М");
    table.addRow("СП", "Структура и выполнение функциональных программ", "13.02.2024", "Малышко В.В.", "вт.", "16:20", "637", "Б 3-4 курс");
    table.addRow("", "Введение в визуальное моделирование программного обеспечения", "12.02.2024", "Малышко В.В.", "пн.", "18:00", "505", "Б 3-4 курс");
    table.addRow("", "Сетевые технологии и протоколы (новый)", "17.02.2024", "Гетьман А.И., Егоров В.И., Пономаренко Р.Е.", "сб.", "14:35", "685", "Б 2-4 курс");
    table.addRow("", "Визуальные нотации программной инженерии", "12.02.2024", "Малышко В.В.", "пн.", "16:20", "505", "М");
    table.addRow("", "Функциональное программирование на языке Scheme", "16.02.2024", "Малышко В.В.", "пт.", "16:20", "637", "М");
    table.addRow("", "Введение в теорию игр (новый)", "21.02.2024", "Ковальчук А.В.", "ср.", "18:00", "576", "Б");
    table.addRow("", "Теория вероятностей и математическая статистика (новый)", "20.02.2024", "Соколов В.В.", "вт.", "18:00", "607", "Б");
    table.addRow("", "Машинное обучение и искусственный интеллект", "", "Смирнов И.Н.", "пт.", "8:45", "72", "М");
    table.addRow("", "Траекторный анализ и его приложения (на англ.яз.)", "", "Смирнов И.Н.", "пн.", "10:30 12:15", "787", "М 2 курс");
    table.addRow("ИО", "Дополнительный главы макромоделей в экономике", "20.02.2024", "Оленев Н.Н.", "вт.", "18:00", "526б", "Б");
    table.addRow("", "Стратегический консалтинг на основе анализа данных", "20.02.2024", "Куренной Д.С., Магницкий Ю.Н.", "вт.", "19:00", "582", "М");
    table.addRow("", "Приложения эконометрики", "15.02.2024", "Куренной Д.С.", "чт.", "18:50", "758", "М");
    table.addRow("", "Принятие макроэкономических решений", "20.02.2024", "Оленев Н.Н.", "вт.", "18:00", "526б", "Асп.");
    table.addRow("ОУ", "Дополнительные главы численных методов оптимального управления", "08.02.2024", "Самсонов С.П.", "чт.", "10:30", "696", "М");
    table.addRow("", "Введение в игровые задачи управления", "21.02.2024", "Кулевский А.В.", "ср.", "16:30", "779", "М");
    table.addRow("НДС", "Архитектура и программирование массивно-параллельных вычислительных систем", "19.02.2024", "Боресков А.В.", "пн.", "19:30", "", "Б");
    table.addRow("Э", "Обратные задачи динамики", "09.02.2024", "Ильин А.В.", "пт.", "14:35", "729", "М 1 к.");
    table.addRow("", "Обобщенное оптимальное управление возмущаемыми динамическими системами", "22.02.2024", "Смольяков Э.Р.", "чт.", "12:50", "", "М 2 к.");
    table.addRow("", "Геометрическая теория нелинейных управляемых систем", "22.02.2024", "Елкин В.И.", "чт.", "12:15", "", "М 2 к.");
    table.addRow("", "Вариационные методы исследования нелинейных управляемых динамических систем", "15.02.2024", "Афанасьев А.П.", "чт.", "14:30", "658", "М");
    table.addRow("", "Неклассические методы теории стабилизации", "", "Фурсов А.С.", "", "", "Асп.");
    table.addRow("", "Обратные задачи теории управления", "", "Ильин А.В.", "", "", "Асп.");
    table.addRow("ММП", "Логический анализ данных в распознавании", "21.02.2024", "Дюкова Е.В., Прокофьев П.А.", "ср.", "16:20", "дист.", "Б");
    table.addRow("", "Логика высказываний", "20.02.2024", "Гуров С.И.", "вт.", "10:40", "дист.", "Б");
    table.addRow("", "Задачи и алгоритмы вычислительной геометрии", "21.02.2024", "Местецкий Л.М.", "ср.", "16:20", "609", "Б");
    table.addRow("", "Методы машинного обучения и поиск закономерностей в данных", "15.02.2024", "Сенько О.В.", "чт.", "18:00", "506", "Б");
    table.addRow("", "Нейросетевые методы обработки изображений", "20.02.2024", "Китов В.В.", "вт.", "16:20", "609", "Б");
    table.addRow("", "Основы математических методов прогнозирования (новый)", "22.03.2024", "Воронцов К.В., Кравцова О.А., Сердюк Ю.А.", "пт.", "16:20", "582", "Б");
    table.addRow("", "Вероятностное тематическое моделирование", "22.02.2024", "Воронцов К.В.", "чт.", "18:00", "658", "");
    table.addRow("МС", "Машинное обучение и аналитика прогнозирования (на англ.яз.)", "23.02.2024", "Назаров Л.В.", "пт.", "19:00", "дист.", "Б");
    table.addRow("", "Аналитические методы в теории массового обслуживания (новый)", "13.02.2024", "Ушаков В.Г.", "вт.", "14:35", "516", "Б");
    table.addRow("", "Машинное обучение с применением R и Python (на англ.яз.)", "24.02.2024", "Назаров Л.В.", "сб.", "19:00", "дист.", "М");
    table.addRow("", "Современный NLP. Большие языковые модели (новый)", "13.02.2024", "Макаренко В.А.", "вт.", "18:00", "П-5", "М");
    table.addRow("", "Классические модели финансовой математики (в непрерывном времени) (на англ.яз.) (новый)", "19.02.2024", "Колокольцов В.Н.", "пн.", "14:35", "505", "М");
    table.addRow("ММП", "Логический анализ данных в распознавании", "21.02.2024", "Дюкова Е.В., Прокофьев П.А.", "ср.", "16:20", "дист.", "Б");
    table.addRow("", "Логика высказываний", "20.02.2024", "Гуров С.И.", "вт.", "10:40", "дист.", "Б");
    table.addRow("", "Задачи и алгоритмы вычислительной геометрии", "21.02.2024", "Местецкий Л.М.", "ср.", "16:20", "609", "Б");
    table.addRow("", "Методы машинного обучения и поиск закономерностей в данных", "15.02.2024", "Сенько О.В.", "чт.", "18:00", "506", "Б");
    table.addRow("", "Нейросетевые методы обработки изображений", "20.02.2024", "Китов В.В.", "вт.", "16:20", "609", "Б");
    table.addRow("", "Основы математических методов прогнозирования (новый)", "22.03.2024", "Воронцов К.В., Кравцова О.А., Сердюк Ю.А.", "пт.", "16:20", "582", "Б");
    
    Div.addElement(table);

    html.addElement(Div);
    html.convert_to_file("test1.html");
}

void test2(){
    HTML site("Billboard Hot 4");

    HTML_Image im1("https://charts-static.billboard.com/img/1988/03/future-f8b-180x180.jpg"), 
    im2("https://charts-static.billboard.com/img/2013/10/hozier-7va-344x344.jpg"),
    im3("https://charts-static.billboard.com/img/2024/02/bensonboone-a8a-beautifulthings-vvt-344x344.jpg"),
    im4("https://charts-static.billboard.com/img/2023/07/teddyswims-vot-losecontrol-4kx-344x344.jpg");

    HTML_Div d1, d2, d3, d4;

    HTML_b track_name1("Like That Future");
    HTML_i track_name2("Too Sweet");
    HTML_u track_name3("Beautiful Things");
    HTML_strike track_name4("Lose Control");

    H5 perfomer1("Metro Boomin & Kendrick Lamar"),
        perfomer2("Hozier"),
        perfomer3("Benson Boone"),
        perfomer4("Teddy Swims");
    d1.addElement(im1).addElement(track_name1).addElement(perfomer1);
    
    d2.addElement(im2).addElement(track_name2).addElement(perfomer2);
    d3.addElement(im3).addElement(track_name3).addElement(perfomer3);
    d4.addElement(im4).addElement(track_name4).addElement(perfomer4);

    site.addElement(d1).addElement(d2).addElement(d3).addElement(d4);

    site.convert_to_file("test2.html");
}

void test3(){
    HTML site;

    HTML_Div div_h;
    H1 h1("Это текст H1");
    H2 h2("Это текст H2");
    H3 h3("Это текст H3");
    H4 h4("Это текст H4");
    H5 h5("Это текст H5");
    H6 h6("Это текст H6");
    div_h.addElement(h1).addElement(h2).addElement(h3).addElement(h4).addElement(h5).addElement(h6);

    HTML_Div div_text;
    HTML_b b("Жирный текст\n");
    HTML_i i("Курсивный текст\n");
    HTML_u u("Подчеркнутый текст\n");
    HTML_strike strike("Зачеркнутый текст\n");
    HTML_p par("Это просто текст\n");
    div_text.addElement(b).addElement(i).addElement(u).addElement(strike).addElement(par);


    HTML_Div div_link;
    HTML_Link link1("Сайт ВМК МГУ", "https://cs.msu.ru/"),
        link2("ВК ВМК МГУ", "https://vk.com/cmcmsu");
    HTML_Image im_vmk("https://i.ytimg.com/vi/8C-mqp0sb_U/maxresdefault.jpg");
    div_link.addElement(im_vmk).addElement(link1).addElement(link2);

    HTML_Div div_in1, div_in2, div_in3, div_in4;
    HTML_p in1("div 1го уровня"),
        in2("div 2го уровня"),
        in3("div 3го уровня"),
        in4("div 4го уровня");

    div_in4.addElement(in4);
    div_in3.addElement(in3).addElement(div_in4);
    div_in2.addElement(in2).addElement(div_in3);
    div_in1.addElement(in1).addElement(div_in2);


    HTML_Div mul_div;
    HTML_Table table(10);
    table.setTableName("Таблица умножения");
    table.setCol_names(" ","1", "2", "3", "4", "5", "6", "7", "8", "9");
    table.addRow("1", "1", "2", "3", "4", "5", "6", "7", "8", "9");
    table.addRow("2", "2", "4", "6", "8", "10", "12", "14", "16", "18");
    table.addRow("3", "3", "6", "9", "12", "15", "18", "21", "24", "27");
    table.addRow("4", "4", "8", "12", "16", "20", "24", "28", "32", "36");
    table.addRow("5", "5", "10", "15", "20", "25", "30", "35", "40", "45");
    table.addRow("6", "6", "12", "18", "24", "30", "36", "42", "48", "54");
    table.addRow("7", "7", "14", "21", "28", "35", "42", "49", "56", "63");
    table.addRow("8", "8", "16", "24", "32", "40", "48", "56", "64", "72");
    table.addRow("9", "9", "18", "27", "36", "45", "54", "63", "72", "81");
    mul_div.addElement(table);



    site.addElement(div_h).addElement(div_text).addElement(div_link).addElement(div_in1).addElement(mul_div);
    site.convert_to_file("test3.html");

}

void try_invalid_constructions(){

    try{
        HTML test1;
        HTML test2;

        test1.addElement(test2);
    }
    catch(exception &e){e.what();}

    try{
        HTML html2;
        HTML_Div div2;
        div2.addElement(html2);
    }
    catch(exception &e){e.what();}

    try{
        HTML html3;
        HTML_Div div3;
        div3.addElement(html3.getBody());
    }
    catch(exception &e){e.what();}
}

int main(int argc, char* argv[]){

    try_invalid_constructions();

    if (argc == 2){
        int num = argv[1][0] - '0';
        switch(num){
            case 1: test1();    break;
            case 2: test2();    break;
            case 3: test3();    break;
        }
    }

}